RT-Thread/rt-thread/bsp/Infineon/libraries/IFX_PSOC6_HAL/mtb-hal-cat1/include/cyhal_sdhc.h
/** SDHC interrupt triggers */
typedef enum {
    CYHAL_SDHC_CMD_COMPLETE         = 0x00001,  //!< Command Complete
    CYHAL_SDHC_XFER_COMPLETE        = 0x00002,  //!< Host read/write transfer is complete
    CYHAL_SDHC_BGAP_EVENT           = 0x00004,  //!< This bit is set when both read/write transaction is stopped at the block gap
    CYHAL_SDHC_DMA_INTERRUPT        = 0x00008,  //!< Host controller detects an SDMA Buffer Boundary during transfer
    CYHAL_SDHC_BUF_WR_READY         = 0x00010,  //!< This bit is set if the Buffer Write Enable changes from 0 to 1
    CYHAL_SDHC_BUF_RD_READY         = 0x00020,  //!< This bit is set if the Buffer Read Enable changes from 0 to 1
    CYHAL_SDHC_CARD_INSERTION       = 0x00040,  //!< This bit is set if the Card Inserted in the Present State register changes from 0 to 1.
    CYHAL_SDHC_CARD_REMOVAL         = 0x00080,  //!< This bit is set if the Card Inserted in the Present State register changes from 1 to 0.
    CYHAL_SDHC_INT_A                = 0x00200,
    CYHAL_SDHC_INT_B                = 0x00400,
    CYHAL_SDHC_INT_C                = 0x00800,
    CYHAL_SDHC_RE_TUNE_EVENT        = 0x01000,  //!< This bit is set if the Re-Tuning Request changes from 0 to 1
    CYHAL_SDHC_FX_EVENT             = 0x02000,  //!< This status is set when R[14] of response register is set to 1
    CYHAL_SDHC_CQE_EVENT            = 0x04000,  //!< This status is set if Command Queuing/Crypto event has occurred
    CYHAL_SDHC_ERR_INTERRUPT        = 0x08000,  //!< If any of the bits in the Error Interrupt Status register are set
    CYHAL_SDHC_ALL_INTERRUPTS       = 0x0FEFF,  //!< Is used to enable/disable all interrupts
} cyhal_sdhc_event_t;

/** I/O voltage levels */
typedef enum
{
    CYHAL_SDHC_IO_VOLTAGE_3_3V                  = 0U,   //!< I/O voltage is 3.3V.
    CYHAL_SDHC_IO_VOLTAGE_1_8V                  = 1U    //!< I/O voltage is 1.8V.
} cyhal_sdhc_io_voltage_t;

/** SDHC I/O voltage select principle */
typedef enum
{
    CYHAL_SDHC_IO_VOLT_ACTION_NEGOTIATE         = 0U,   //!< (Recommended) HAL driver performs all steps, needed for switching I/O bus voltage to certain level: sends needed commands to prepare card, changes level of io_volt_sel pin and performs switching sequence according to SD specification.
    CYHAL_SDHC_IO_VOLT_ACTION_SWITCH_SEQ_ONLY   = 1U,   //!< HAL driver performs switching sequence (if voltage is being switched to 1.8V) and changes io_volt_sel pin level accordingly. No commands are being send to the card in this mode.
    CYHAL_SDHC_IO_VOLT_ACTION_NONE              = 2U,   //!< I/O voltage is changed by changing io_volt_sel pin's level. No commands are being send to the card in this mode.
} cyhal_sdhc_io_volt_action_type_t;

/** SDHC response types */
typedef enum
{
    CYHAL_SDHC_RESPONSE_NONE        = 0U,       //!< No Response.
    CYHAL_SDHC_RESPONSE_LEN_136     = 1U,       //!< Response Length 136.
    CYHAL_SDHC_RESPONSE_LEN_48      = 2U,       //!< Response Length 48.
    CYHAL_SDHC_RESPONSE_LEN_48B     = 3U        //!< Response Length 48. Check Busy after response.
} cyhal_sdhc_cmd_response_type_t;

/** SDHC auto command enable selection. */
typedef enum
{
    CYHAL_SDHC_AUTO_CMD_NONE        = 0U,       //!< Auto command disable.
    CYHAL_SDHC_AUTO_CMD_12          = 1U,       //!< Auto command 12 enable.
    CYHAL_SDHC_AUTO_CMD_23          = 2U,       //!< Auto command 23 enable.
    CYHAL_SDHC_AUTO_CMD_AUTO        = 3U        //!< Auto command Auto enable.
} cyhal_sdhc_auto_cmd_t;

/** SDHC command types */
typedef enum
{
    CYHAL_SDHC_CMD_NORMAL           = 0U,       //!< Other commands.
    CYHAL_SDHC_CMD_SUSPEND          = 1U,       //!< CMD52 for writing "Bus Suspend" in CCCR.
    CYHAL_SDHC_CMD_RESUME           = 2U,       //!< CMD52 for writing "Function Select" in CCCR.
    CYHAL_SDHC_CMD_ABORT            = 3U        //!< CMD12, CMD52 for writing "I/O Abort" in CCCR.
} cyhal_sdhc_cmd_type_t;

/** SDHC command error states */
typedef enum
{
    /** Last operation did not cause any error status. */
    CYHAL_SDHC_NO_ERR               = 0x0000U,
    /** Command timeout error. In SD/eMMC Mode, this event is set only if no response is returned
    * within 64 SD clock cycles from the end bit of the command. If the Host Controller detects a CMD line conflict,
    * along with Command CRC Error bit, this event is set to 1, without waiting for 64 SD/eMMC card clock cycles. */
    CYHAL_SDHC_CMD_TOUT_ERR         = 0x0001U,
    /** Command CRC error. A Command CRC Error is generated in SD/eMMC mode when:
    * 1. A response is returned and the Command Timeout Error is set to 0 (indicating no timeout),
    * this bit is set to 1 when detecting a CRC error in the command response.
    * 2. The Host Controller detects a CMD line conflict by monitoring the CMD line when a command is issued. If
    * the Host Controller drives the CMD line to level 1, but detects level 0 on the CMD line at the next SD clock
    * edge, then the Host Controller aborts the command (stop driving CMD line) and sets this bit to 1. The Command
    * Timeout Error is also set to 1 to distinguish a CMD line conflict. */
    CYHAL_SDHC_CMD_CRC_ERR          = 0x0002U,
    /** Command End Bit error. This bit is set after detecting that the end bit of a command response is 0 in SD/eMMC mode. */
    CYHAL_SDHC_CMD_END_BIT_ERR      = 0x0004U,
    /** Command Index error. This bit is set if a Command Index error occurs in the command response in SD/eMMC mode. */
    CYHAL_SDHC_CMD_IDX_ERR          = 0x0008U,
    /** Data Timeout error. This bit is set in SD/eMMC mode when detecting one of the following timeout conditions:
    * *  Busy timeout for R1b, R5b type
    * *  Busy timeout after Write CRC status
    * *  Write CRC Status timeout
    * *  Read Data timeout. */
    CYHAL_SDHC_DATA_TOUT_ERR        = 0x0010U,
    /** Data CRC error. This error occurs in SD/eMMC mode after detecting a CRC error while transferring read data
    * that uses the DAT line, detecting the Write CRC status having a value other than 010 or when writing a CRC status timeout. */
    CYHAL_SDHC_DATA_CRC_ERR         = 0x0020U,
    /** Data End Bit error. This error occurs in SD/eMMC mode either when detecting 0 at the end bit position of read
    * data that uses the DAT line or at the end bit position of the CRC status. */
    CYHAL_SDHC_DATA_END_BIT_ERR     = 0x0040U,
    /** Current Limit error. */
    CYHAL_SDHC_CUR_LMT_ERR          = 0x0080U,
    /** Auto CMD error. This error status is used by Auto CMD12 and Auto CMD23 in SD/eMMC mode. This bit is set after
    * detecting that any of the bits D00 to D05 in the Auto CMD Error Status register has changed from 0 to 1. D07 is
    * effective in case for Auto CMD12. The Auto CMD Error Status register is valid while this bit is set to 1 and may
    * be cleared by clearing this bit. */
    CYHAL_SDHC_AUTO_CMD_ERR         = 0x0100U,
    /** ADMA error. This bit is set when the Host Controller detects an error during an ADMA-based data transfer.
    * The possible reasons for an error:
    * * An error response is received from the System bus;
    * * ADMA3, ADMA2 Descriptors are invalid;
    * * CQE Task or Transfer descriptors are invalid.
    * When an error occurs, the state of the ADMA is saved in the ADMA Error Status register. */
    CYHAL_SDHC_ADMA_ERR             = 0x0200U,
    /** Tuning error. */
    CYHAL_SDHC_TUNNING_ERR          = 0x0400U,
    /** Response error. Host Controller Version 4.00 supports the response error check function to avoid overhead of
    * the response error check by Host Driver during DMA execution. If the Response Error Check Enable is set to 1 in
    * the Transfer Mode register, the Host Controller checks R1 or R5 response. If an error is detected in a response,
    * this bit is set to 1. This is applicable in SD/eMMC mode. */
    CYHAL_SDHC_RESP_ERR             = 0x0800U,
    /** Boot Acknowledgement error. This bit is set when there is a timeout for boot acknowledgement or after detecting
    * the boot ACK status having a value other than 010. This is applicable only when boot acknowledgement is expected in eMMC mode. */
    CYHAL_SDHC_BOOT_ACK_ERR         = 0x1000U
} cyhal_sdhc_error_type_t;

