RT-Thread/rt-thread/bsp/Infineon/libraries/IFX_PSOC6_HAL/mtb-hal-cat1/include/cyhal_sdhc.h
/*******************************************************************************
*       Typedefs
*******************************************************************************/

/** Handler for SDHC interrupts */
typedef void (*cyhal_sdhc_event_callback_t)(void *callback_arg, cyhal_sdhc_event_t event);

/*******************************************************************************
*       Data Structures
*******************************************************************************/

/** Defines configuration options for the SDHC block */
typedef struct
{
    bool                            enableLedControl;               //!< Drive one IO to indicate when the card is being accessed
    bool                            lowVoltageSignaling;            //!< Whether 1.8V signaling is supported
    bool                            isEmmc;                         //!< true if eMMC card, otherwise false
    uint8_t                         busWidth;                       //!< The desired bus width, 1-bit, 4-bit, 8-bit
} cyhal_sdhc_config_t;

/** Defines data configuration */
typedef struct
{
    uint32_t*                       data_ptr;                        //!< The pointer to data for send/receive. Data will be transfered using DMA, which will be configured automaticaly by SDHC HAL driver.
    uint32_t                        block_size;                      //!< The size of the data block.
    uint32_t                        number_of_blocks;                //!< The number of blocks with size block_size to send.
    cyhal_sdhc_auto_cmd_t           auto_command;                    //!< Selects which auto commands are used if any.
    bool                            is_read;                         //!< true = Read from the card, false = Write to the card.
} cyhal_sdhc_data_config_t;

/** Defines command configuration for \ref cyhal_sdhc_send_cmd function */
typedef struct
{
    uint32_t                        command_index;                   //!< The index of the command.
    uint32_t                        command_argument;                //!< The argument for the command.
    bool                            enable_crc_check;                //!< Enables the CRC check on the response.
    cyhal_sdhc_cmd_response_type_t  response_type;                   //!< The response type.
    bool                            enable_idx_check;                //!< Checks the index of the response.
    cyhal_sdhc_cmd_type_t           command_type;                    //!< The command type.
    cyhal_sdhc_data_config_t        *data_config;                    //!< Data transfer configuration, defined in \ref cyhal_sdhc_data_config_t. Should be NULL if data transfer is not expected for provided command.
} cyhal_sdhc_cmd_config_t;

/*******************************************************************************
*       Functions
*******************************************************************************/

/** Initialize SDHC driver and corresponding hardware.
 *
 * @param[out] obj                  Pointer to an SDHC object. The caller must allocate the memory for this object but
 *  the init function will initialize its contents.
 * @param[in]  config               The card configuration object
 * @param[out] clk                  The pin connected to the clk signal
 * @param[in]  cmd                  The pin connected to the command signal
 * @param[in]  data0                The pin connected to the data0 signal
 * @param[in]  data1                The pin connected to the data1 signal. This pin can be NC if bus width is 1-bit.
 * @param[in]  data2                The pin connected to the data2 signal. This pin can be NC if bus width is 1-bit.
 * @param[in]  data3                The pin connected to the data3 signal. This pin can be NC if bus width is 1-bit.
 * @param[in]  data4                The pin connected to the data4 signal. This pin can be NC if bus width is less than 8-bit.
 * @param[in]  data5                The pin connected to the data5 signal. This pin can be NC if bus width is less than 8-bit.
 * @param[in]  data6                The pin connected to the data6 signal. This pin can be NC if bus width is less than 8-bit.
 * @param[in]  data7                The pin connected to the data7 signal. This pin can be NC if bus width is less than 8-bit.
 * @param[in]  card_detect          The pin connected to the card_detect signal
 *  Card is considered as inserted if card_detect pin in low state.
 *  This pin can be NC.
 * @param[out] io_volt_sel          The pin connected to the io_volt_sel signal. This pin changes the logic level on the
 *  sd_io_volt_sel line. It assumes that this line is used to control a regulator connected to the VDDIO of the MCU.
 *  This regulator allows for switching between the 3.3V and 1.8V signaling. High level on the pin stands for
 *  1.8V signaling, while low - for 3.3V.
 *  This pin can be NC.
 * @param[out] card_pwr_en          The pin connected to the card_pwr_en signal This pin can be used to enable a voltage
 *  regulator used to power the card. High level on the pin - card is powered. Low - card is not powered.
 *  This pin can be NC.
 * @param[in]  card_mech_write_prot The pin connected to the card_mech_write_prot signal This pin is used for card
 *  mechanical write protect checking.
 *  If pin in high state - card is mechanically write protected, if in low state - card is not mechanically write
 *  protected.
 *  \ref cyhal_sdhc_is_card_mech_write_protected function can be used to check card write protection state.
 *  This pin can be NC.
 * @param[in]  led_ctrl             The pin connected to the led_ctrl signal. This pin can be NC.
 * @param[in]  emmc_reset           The pin connected to the emmc_reset signal. This pin can be NC.
 * @param[in]  block_clk            The clock to use can be shared, if not provided a new clock will be allocated
 * @return The status of the init request
 *
 */
cy_rslt_t cyhal_sdhc_init_hw(cyhal_sdhc_t *obj,
                        const cyhal_sdhc_config_t *config,
                        cyhal_gpio_t cmd,
                        cyhal_gpio_t clk,
                        cyhal_gpio_t data0,
                        cyhal_gpio_t data1,
                        cyhal_gpio_t data2,
                        cyhal_gpio_t data3,
                        cyhal_gpio_t data4,
                        cyhal_gpio_t data5,
                        cyhal_gpio_t data6,
                        cyhal_gpio_t data7,
                        cyhal_gpio_t card_detect,
                        cyhal_gpio_t io_volt_sel,
                        cyhal_gpio_t card_pwr_en,
                        cyhal_gpio_t card_mech_write_prot,
                        cyhal_gpio_t led_ctrl,
                        cyhal_gpio_t emmc_reset,
                        cyhal_clock_t *block_clk);

/** Initialize the connected card.
 * \note This function should be called after \ref cyhal_sdhc_init_hw
 *
 * @param[in,out] obj               The SDHC object
 * @return The status of the card init request
 */
cy_rslt_t cyhal_sdhc_init_card(cyhal_sdhc_t *obj);

/** Initialize the SDHC block and connected card.
 * This function is a combination of \ref cyhal_sdhc_init_hw and \ref cyhal_sdhc_init_card calls.
 * \note refer to \ref cyhal_sdhc_init_hw function description for detailed parameter guidance.
 *
 * @param[out] obj                  Pointer to an SDHC object. The caller must allocate the memory for this object but
 *  the init function will initialize its contents.
 * @param[in]  config               The card configuration object
 * @param[out] clk                  The pin connected to the clk signal
 * @param[in]  cmd                  The pin connected to the command signal
 * @param[in]  data0                The pin connected to the data0 signal
 * @param[in]  data1                The pin connected to the data1 signal. This pin can be NC if bus width is 1-bit.
 * @param[in]  data2                The pin connected to the data2 signal. This pin can be NC if bus width is 1-bit.
 * @param[in]  data3                The pin connected to the data3 signal. This pin can be NC if bus width is 1-bit.
 * @param[in]  data4                The pin connected to the data4 signal. This pin can be NC if bus width is less than 8-bit.
 * @param[in]  data5                The pin connected to the data5 signal. This pin can be NC if bus width is less than 8-bit.
 * @param[in]  data6                The pin connected to the data6 signal. This pin can be NC if bus width is less than 8-bit.
 * @param[in]  data7                The pin connected to the data7 signal. This pin can be NC if bus width is less than 8-bit.
 * @param[in]  card_detect          The pin connected to the card_detect signal
 * @param[out] io_volt_sel          The pin connected to the io_volt_sel signal
 * @param[out] card_pwr_en          The pin connected to the card_pwr_en signal
 * @param[in]  card_mech_write_prot The pin connected to the card_mech_write_prot signal
 * @param[in]  led_ctrl             The pin connected to the led_ctrl signal
 * @param[in]  emmc_reset           The pin connected to the emmc_reset signal
 * @param[in]  block_clk            The clock to use can be shared, if not provided a new clock will be allocated
 * @return The status of the init request
 *
 */
cy_rslt_t cyhal_sdhc_init(cyhal_sdhc_t *obj,
                          const cyhal_sdhc_config_t *config,
                          cyhal_gpio_t cmd,
                          cyhal_gpio_t clk,
                          cyhal_gpio_t data0,
                          cyhal_gpio_t data1,
                          cyhal_gpio_t data2,
                          cyhal_gpio_t data3,
                          cyhal_gpio_t data4,
                          cyhal_gpio_t data5,
                          cyhal_gpio_t data6,
                          cyhal_gpio_t data7,
                          cyhal_gpio_t card_detect,
                          cyhal_gpio_t io_volt_sel,
                          cyhal_gpio_t card_pwr_en,
                          cyhal_gpio_t card_mech_write_prot,
                          cyhal_gpio_t led_ctrl,
                          cyhal_gpio_t emmc_reset,
                          cyhal_clock_t *block_clk);

