RT-Thread/rt-thread/bsp/Infineon/libraries/IFX_PSOC6_HAL/mtb-hal-cat1/include/cyhal_sdhc.h
/** Release the SDHC peripheral, not currently invoked. It requires further
 *  resource management.
 *
 * @param[in,out] obj               The SDHC object
 */
void cyhal_sdhc_free(cyhal_sdhc_t *obj);

/** Attempts to read data synchronously over the SDHC peripheral.
 *
 * This will read as many blocks as possible, up to `length` blocks, into the buffer
 * pointed to by `data`, then return. The value pointed to by `length` will be
 * updated to reflect the number of words that were actually read.
 *
 * See \ref subsection_sdhc_snippet_2
 *
 * @param[in]     obj               The SDHC object
 * @param[in]     address           The address to read data from
 * @param[out]    data              Pointer to the byte-array where data read from the device should be stored
 * @param[in,out] length            Number of 512 byte blocks to read, updated with the number actually read
 * @return The status of the read request
 */
cy_rslt_t cyhal_sdhc_read(cyhal_sdhc_t *obj, uint32_t address, uint8_t *data, size_t *length);

/** Attempts to write data synchronously over SDHC peripheral
 *
 * This will write as many blocks as possible, up to `length` blocks, then return.
 * The value pointed to by `length` will be updated to reflect the number of words
 * that were actually read.
 *
 * See \ref subsection_sdhc_snippet_3
 *
 * @param[in]     obj               The SDHC object
 * @param[in]     address           The address to write data to
 * @param[in]     data              Pointer to the byte-array of data to write to the device
 * @param[in,out] length            Number of 512 byte blocks to write, updated with the number actually written
 * @return The status of the write request
 *
 */
cy_rslt_t cyhal_sdhc_write(cyhal_sdhc_t *obj, uint32_t address, const uint8_t *data, size_t *length);

/** Erases a block of data over the SDHC peripheral
 *
 * @param[in] obj                   The SDHC object
 * @param[in] start_addr            Is the address of the first byte to erase
 * @param[in] length                Number of 512 byte blocks (starting at start_addr) to erase
 * @param[in] timeout_ms            Timeout value in ms for waiting/polling operations. If zero is provided
 * for this parameter the default value will be used. See implementation specific
 * documentation for timeout details.
 * @return The status of the erase request
 *
 */
cy_rslt_t cyhal_sdhc_erase(cyhal_sdhc_t *obj, uint32_t start_addr, size_t length, uint32_t timeout_ms);

/** Start SDHC asynchronous read
 *
 * This will transfer `length` 512 byte blocks into the buffer pointed to by `data` in the background.
 * When the requested quantity of data has been read, the \ref CYHAL_SDHC_XFER_COMPLETE event will
 * be raised. See \ref cyhal_sdhc_register_callback and \ref cyhal_sdhc_enable_event.
 *
 * @param[in]     obj               The SDHC object that holds the transfer information
 * @param[in]     address           The address to read data from
 * @param[out]    data              The receive buffer
 * @param[in,out] length            Number of 512 byte blocks to read, updated with the number actually read
 * @return The status of the read_async request
 */
cy_rslt_t cyhal_sdhc_read_async(cyhal_sdhc_t *obj, uint32_t address, uint8_t *data, size_t *length);

/** Start asynchronous SDHC write
 *
 * This will transfer `length` 512 byte blocks from the buffer pointed to by `data` in the background.
 * When the requested quantity of data has been written, the \ref CYHAL_SDHC_XFER_COMPLETE event
 * will be raised. See \ref cyhal_sdhc_register_callback and \ref cyhal_sdhc_enable_event.
 *
 * @param[in]     obj               The SDHC object that holds the transfer information
 * @param[in]     address           The address to write data to
 * @param[in]     data              The transmit buffer
 * @param[in,out] length            The number of 512 byte blocks to write, updated with the number actually written
 * @return The status of the write_async request
 */
cy_rslt_t cyhal_sdhc_write_async(cyhal_sdhc_t *obj, uint32_t address, const uint8_t *data, size_t *length);

/** Checks if the specified SDHC peripheral is in use
 *
 * @param[in]  obj                  The SDHC peripheral to check
 * @return Indication of whether the SDHC is still transmitting
 */
bool cyhal_sdhc_is_busy(const cyhal_sdhc_t *obj);

/** Abort an SDHC transfer
 *
 * @param[in] obj                   The SDHC peripheral to stop
 * @return The status of the abort_async request
 */
cy_rslt_t cyhal_sdhc_abort_async(cyhal_sdhc_t *obj);

/** Register an SDHC callback handler
 *
 * This function will be called when one of the events enabled by \ref cyhal_sdhc_enable_event occurs.
 *
 * @param[in] obj                   The SDHC object
 * @param[in] callback              The callback handler which will be invoked when the event fires
 * @param[in] callback_arg          Generic argument that will be provided to the callback when called
 */
void cyhal_sdhc_register_callback(cyhal_sdhc_t *obj, cyhal_sdhc_event_callback_t callback, void *callback_arg);

/** Configure SDHC event enablement.
 *
 * When an enabled event occurs, the function specified by \ref cyhal_sdhc_register_callback will be called.
 *
 * @param[in] obj                   The SDHC object
 * @param[in] event                 The SDHC event type
 * @param[in] intr_priority         The priority for NVIC interrupt events
 * @param[in] enable                True to turn on interrupts, False to turn off
 */
void cyhal_sdhc_enable_event(cyhal_sdhc_t *obj, cyhal_sdhc_event_t event, uint8_t intr_priority, bool enable);

/** Checks if SD card is inserted
 *
 * @param[in]  obj                  The SDHC peripheral to check
 * @return Indication of whether the card is inserted.
 */
bool cyhal_sdhc_is_card_inserted(const cyhal_sdhc_t *obj);

/** Checks if the inserted SD card is mechanically write protected
 *
 * @param[in]  obj                  The SDHC peripheral to check
 * @return Indication of whether the inserted SD card is mechanically write protected
 */
bool cyhal_sdhc_is_card_mech_write_protected(const cyhal_sdhc_t *obj);

