RT-Thread/rt-thread/bsp/Infineon/libraries/IFX_PSOC6_HAL/mtb-hal-cat1/include/cyhal_sdhc.h
/** Get block count of inserted SD card / eMMC
 * \note SDHC driver should be initialized with \ref cyhal_sdhc_init prior to using this function.
 *
 * @param[in]  obj                  The SDHC object
 * @param[in]  block_count          Pointer to variable where block count will be stored
 * @return The status of the operation
 */
cy_rslt_t cyhal_sdhc_get_block_count(cyhal_sdhc_t *obj, uint32_t *block_count);

/** Sets the SD bus frequency (frequency on which SD card / eMMC is accessed)
 * \note Actual frequency may differ from the desired frequency due to available dividers and the frequency of source clock.
 * Function will set the closest possible (but not greater than) frequency to what was requested.
 * Use \ref cyhal_sdhc_get_frequency function to get actual frequency value that was achieved and set.
 * \note If data timeout was configured by \ref cyhal_sdhc_set_data_read_timeout, it can be automaticaly recalculated
 * according to new SD bus frequency. For details, please refer to \ref cyhal_sdhc_set_data_read_timeout function description.
 *
 * @param[in]  obj                  The SDHC object
 * @param[in]  hz                   Desired SD bus frequency in Hz
 * @param[in]  negotiate            Whether new frequency value needs to be negotiated with card or not. true is
 *  recommended and it means that new frequency will be negotiated.
 * @return The status of the operation
 */
cy_rslt_t cyhal_sdhc_set_frequency(cyhal_sdhc_t *obj, uint32_t hz, bool negotiate);

/** Get the actual frequency that SD bus is configured for
 *
 * @param[in] obj                   The SDHC object
 * @return Frequency in Hz
 */
uint32_t cyhal_sdhc_get_frequency(cyhal_sdhc_t *obj);

/** Sets the maximum time to wait for data from the card. The time is specified in number of card clock cycles.
 * With SD bus frequency changed by \ref cyhal_sdhc_set_frequency, timeout can automaticaly be recalculated according
 * to new clock frequency. This can be activated by 'auto_reconfigure' parameter.
 *
 * @param[in]  obj                  The SDHC object
 * @param[in]  timeout              Time to wait for data from the card.
 * @param[in]  auto_reconfigure     Timeout value will be automaticaly reconfigured upon clock change
 *
 * @return The status of the operation
 */
cy_rslt_t cyhal_sdhc_set_data_read_timeout(cyhal_sdhc_t *obj, uint32_t timeout, bool auto_reconfigure);

/**  Initializes the SD block and DMA for a data transfer. It does not start a transfer.
 *  \ref cyhal_sdhc_send_cmd needs to be called after this function in order to start data transfer.
 *
 * @param[in]  obj                  The SDHC object
 * @param[in]  data_config          Data transfer configuration
 * @return The status of the operation
 */
cy_rslt_t cyhal_sdhc_config_data_transfer(cyhal_sdhc_t *obj, cyhal_sdhc_data_config_t *data_config);

/** Sends a command to the card and wait until it is sent. If the command assumes data transfer via data lines,
 * \ref cyhal_sdhc_config_data_transfer function needs to be called prior to this one. The response of issued command
 * can be retrieved by using \ref cyhal_sdhc_get_response function.
 * \note Function does not wait until data (configured with \ref cyhal_sdhc_config_data_transfer) transfer complete.
 * In order to do so, user can:
 * - register \ref CYHAL_SDHC_XFER_COMPLETE and wait for it
 * - wait until \ref cyhal_sdhc_is_busy return false
 * - use \ref cyhal_sdhc_wait_transfer_complete function
 *
 * @param[in]  obj                  The SDHC object
 * @param[in]  cmd_config           Command configuration
 * @return The status of the operation
 */
cy_rslt_t cyhal_sdhc_send_cmd(cyhal_sdhc_t *obj, cyhal_sdhc_cmd_config_t *cmd_config);

/** Returns a response of last issued by \ref cyhal_sdhc_send_cmd function command.
 *
 * @param[in]  obj                  The SDHC object
 * @param[in]  response             Pointer to array where response will be stored
 * @param[in]  large_response       If true, the expected response is 136 bits, false - 48 bits, which corresponds to
 * 120 and 32 bits of useful for application data respectively. So for large_response 4 uint32_t element array can be used
 * while for not large_response 1 uint32_t value will be enough.
 * @return The status of the operation
 */
cy_rslt_t cyhal_sdhc_get_response(cyhal_sdhc_t *obj, uint32_t *response, bool large_response);

/** Wait for asynchronous data transfer to complete. Such data transfer can be triggered by \ref cyhal_sdhc_write_async,
 * \ref cyhal_sdhc_read_async or by \ref cyhal_sdhc_config_data_transfer + \ref cyhal_sdhc_send_cmd functions.
 *
 * @param[in]  obj                  The SDHC object
 * @return The status of the operation
 */
cy_rslt_t cyhal_sdhc_wait_transfer_complete(cyhal_sdhc_t *obj);

/** Sets the voltage level of the I/O lines.
 * \note This function requires io_volt_sel and (for some cases) card_pwr_en pins to be assigned. Please refer to
 *  \ref cyhal_sdhc_init_hw for pin details.
 * \note Switching from 1.8V to 3.3V can be done only via power cycle sequence (power down card, wait, power up card),
 *  which is supported by HAL driver and performed only if CYHAL_SDHC_IO_VOLT_ACTION_NEGOTIATE selected. card_pwr_en pin
 *  has to be assigned. Please refer to \ref cyhal_sdhc_init_hw for pin details.
 *
 * @param[in]  obj                  The SDHC object
 * @param[in]  io_voltage           I/O voltage to be set on lines
 * @param[in]  io_switch_type       Defines how I/O voltage will be switched
 * @return The status of the operation
 */
cy_rslt_t cyhal_sdhc_set_io_voltage(cyhal_sdhc_t *obj, cyhal_sdhc_io_voltage_t io_voltage, cyhal_sdhc_io_volt_action_type_t io_switch_type);

/** Returns the current voltage level of the I/O lines
 *
 * @param[in]   obj                 The SDHC object
 * @return Current I/O voltage setting value
 */
cyhal_sdhc_io_voltage_t cyhal_sdhc_get_io_voltage(cyhal_sdhc_t *obj);

/** Configures data bus width on host side and (optionally) informs the card about new width configuration.
 *
 * @param[in]  obj                  The SDHC object
 * @param[in]  bus_width            The desired bus width, 1-bit, 4-bit, 8-bit
 * @param[in]  configure_card       Whether card needs to be configured with new bus width. true is recommended.
 * @return The status of the operation
 */
cy_rslt_t cyhal_sdhc_set_bus_width(cyhal_sdhc_t *obj, uint8_t bus_width, bool configure_card);

