RT-Thread/rt-thread/bsp/Infineon/libraries/IFX_PSOC6_HAL/mtb-hal-cat1/include/cyhal_sdhc.h
/** Returns currently configured data bus width
 *
 * @param[in]  obj                  The SDHC object
 * @return Currently configured bus width, 1-bit, 4-bit, 8-bit
 */
uint8_t cyhal_sdhc_get_bus_width(cyhal_sdhc_t *obj);

/** Returns last issued SD operation error states. This function can be used for error checking after any of cmd / data
 * transfer-related operations. For list of possible errors, that are being tracked, please refer to \ref cyhal_sdhc_error_type_t.
 *
 * @param[in]   obj                 The SDHC object
 * @return Errors occurred during last command
 */
cyhal_sdhc_error_type_t cyhal_sdhc_get_last_command_errors(cyhal_sdhc_t *obj);

/** Clears SDHC hardware error states. Error statuses are indicated by \ref cyhal_sdhc_get_last_command_errors function.
 *
 * @param[in]   obj                 The SDHC object
 */
void cyhal_sdhc_clear_errors(cyhal_sdhc_t *obj);

/** Resets CMD and Data lines and corresponding circuits of SD Host.
 *
 * @param[in]   obj                 The SDHC object
 */
void cyhal_sdhc_software_reset(cyhal_sdhc_t *obj);

/** Powers up / down the card based on provided parameter. This function uses card_pwr_en pin to change card power
 * state. Please refer to \ref cyhal_sdhc_init_hw for pin description.
 *
 * @param[in]  obj                  The SDHC peripheral to configure
 * @param[in]  enable               Card is powered if true, not powered if false.
 * @return The status of the operation
 */
cy_rslt_t cyhal_sdhc_enable_card_power(cyhal_sdhc_t *obj, bool enable);

/** Initialize the SDHC peripheral using a configurator generated configuration struct.
 *
 * @param[in]  obj                  The SDHC peripheral to configure
 * @param[in]  cfg                  Configuration structure generated by a configurator.
 * @return The status of the operation
 */
cy_rslt_t cyhal_sdhc_init_cfg(cyhal_sdhc_t *obj, const cyhal_sdhc_configurator_t *cfg);

#if defined(__cplusplus)
}
#endif

#ifdef CYHAL_SDHC_IMPL_HEADER
#include CYHAL_SDHC_IMPL_HEADER
#endif /* CYHAL_SDHC_IMPL_HEADER */

/** \} group_hal_sdhc */
